{"extracted_information": "The article details quarterback Darian Mensah's transfer from Tulane to Duke, including his motivations and the influence of Duke Head Coach Manny Diaz. Mensah discusses the difficulty of leaving Tulane but cites the desire to play in a competitive conference (ACC, Power Four) and secure financial freedom for his family via a significant NIL deal as key reasons for the move. He also highlights the positive impression Manny Diaz made on him during the recruiting process. Mensah felt a strong connection to Diaz's vision and wanted to play for a coach like him. He specifically mentioned learning from Diaz's defensive perspective during film study as crucial. The decision wasn't just about money but also about achieving his goal of playing in the NFL, believing Duke is the place to do so. He also noted that Offensive Coordinator Jonathan Brewer has tailored the offense to his strengths. Mensah was initially surprised Duke became a top option but research confirmed it was the best opportunity. Despite the attention from the transfer portal buzz and the substantial NIL deal, Mensah is focused on team goals like reaching the playoffs and individual goals like being one of the best players in the country.", "specifications": {}, "pricing": {"total_nil_deal": "$8 million", "first_season_earning": "more than $3 million", "other_transfers_nil": {"Carson Beck (Miami)": "reportedly $4 million", "Nico Iamaleava (former Tennessee)": "looked for a similar haul"}}, "features": [], "statistics": {"tulane_stats_breakout_year": {"passing_yards": "2,723", "passing_touchdowns": "22"}, "tulane_season_record": "9-5", "transfer_portal_ranking": "No. 4 QB (according to On3)", "recruitment_ranking": "3-star recruit (initially)"}, "temporal_info": {"article_publish_date": "Jun 16, 2025", "article_publish_time": "8:53 PM CDT", "mensah_tulane_tenure": "two years", "eligibility_remaining_upon_transfer": "three years", "redshirt_year": "2023"}, "geographical_data": {"mensah_previous_school": "Tulane", "mensah_new_school": "Duke (Durham)", "mensah_hometown": "Lakewood, California", "competitive_conference_desired": "ACC, Power Four", "offers_from_other_conferences": "SEC"}, "references": ["On3’s Pete Nakos", "On3 (@On3sports) tweet (June 16, 2025)", "Link to On3 story: https://t.co/W1AteJmlo1", "Mensah's agents: Noah Reisenfeld and Adie von Gontard (Young Money APAA Sports)", "Duke Offensive Coordinator: Jonathan Brewer"], "quotes": [{"person": "Darian Mensah", "quote": "It was very tough to leave my home."}, {"person": "Darian Mensah", "quote": "I was at Tulane for two years, super grateful for that place. It made me who I am today. Definitely not easy to leave all my teammates, those are my guys. But I wanted to play in a competitive conference like the ACC, in the Power Four. And I knew this move would set my family up for financial freedom. Those are some of the things that went into that decision."}, {"person": "Darian Mensah", "quote": "I feel like Manny, when we met in the portal, he’s the kind of guy when he talks, you listen. I wanted to play for a head coach like him."}, {"person": "Darian Mensah", "quote": "I spoke to a bunch of programs, my agents did for me."}, {"person": "Darian Mensah", "quote": "Thinking of Duke as the top name at first, for sure, I’d say, was a little bit surprising. But I did my research, because it’s a pretty big decision, and after doing my research, this was the best opportunity for me to get to where I want."}, {"person": "Darian Mensah", "quote": "Obviously, the NIL component was pretty important, but it wasn’t the primary focus."}, {"person": "Darian Mensah", "quote": "The primary focus is to play in the NFL, so I feel like Duke is a place where I can achieve that. During the season, I just let my agent, Noah [Reisenfeld] and Adie [von Gontard], I feel like they did a phenomenal job keeping me focused on what I needed to do during the season. I’m at where I am now, so I’m grateful for them."}, {"person": "Darian Mensah", "quote": "They had a clear vision for me that they set out."}, {"person": "Darian Mensah", "quote": "I liked that. Coach Manny has a defensive mind, and just having that perspective when watching film. We try to watch tape two to three times a week, and having an elite defensive perspective when it comes to knowing defenses is crucial."}, {"person": "Darian Mensah", "quote": "Easily the best thing is how much Coach [Jonathan] Brewer has catered the offense to things that I like to do. Moving around the pocket, a lot more drop back, quick game—just getting the ball in my hands fast."}, {"person": "Darian Mensah", "quote": "Definitely felt good."}, {"person": "Darian Mensah", "quote": "The playoffs are definitely a feat I think we can accomplish. I’m trying to be one of the best in the country next year. Trying to be in New York City."}]}